; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	infrared2 - mode
	image0 - mode
	infrared1 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Star0 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument1 infrared1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared2)
	(supports instrument2 infrared1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet12)
)
(:goal (and
	(pointing satellite0 Star0)
	(have_image Phenomenon5 infrared2)
	(have_image Phenomenon6 infrared2)
	(have_image Planet7 image0)
	(have_image Planet8 image0)
	(have_image Planet9 infrared1)
	(have_image Phenomenon10 infrared2)
	(have_image Planet11 infrared2)
	(have_image Planet12 infrared1)
	(have_image Planet13 infrared1)
	(have_image Phenomenon14 infrared2)
))

)

; plan
1. (turn_to satellite1 star0 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star0)
   goals met: 0 of 11
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 11
3. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 11
4. (turn_to satellite1 planet11 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet11)
   goals met: 0 of 11
5. (take_image satellite1 planet11 instrument2 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 1 of 11
6. (turn_to satellite1 phenomenon6 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon6)
   goals met: 1 of 11
7. (take_image satellite1 phenomenon6 instrument2 infrared2)
   added: (have_image phenomenon6 infrared2)
   goals met: 2 of 11
8. (turn_to satellite1 phenomenon5 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon5)
   goals met: 2 of 11
9. (take_image satellite1 phenomenon5 instrument2 infrared2)
   added: (have_image phenomenon5 infrared2)
   goals met: 3 of 11
10. (turn_to satellite1 phenomenon14 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon14)
   goals met: 3 of 11
11. (take_image satellite1 phenomenon14 instrument2 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 4 of 11
12. (turn_to satellite1 phenomenon10 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon10)
   goals met: 4 of 11
13. (turn_to satellite0 star0 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star0)
   goals met: 5 of 11
14. (take_image satellite1 phenomenon10 instrument2 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 6 of 11
15. (turn_to satellite1 planet12 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet12)
   goals met: 6 of 11
16. (take_image satellite1 planet12 instrument2 infrared1)
   added: (have_image planet12 infrared1)
   goals met: 7 of 11
17. (turn_to satellite1 planet13 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet13)
   goals met: 7 of 11
18. (take_image satellite1 planet13 instrument2 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 8 of 11
19. (turn_to satellite1 planet7 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet7)
   goals met: 8 of 11
20. (take_image satellite1 planet7 instrument2 image0)
   added: (have_image planet7 image0)
   goals met: 9 of 11
21. (turn_to satellite1 planet8 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet8)
   goals met: 9 of 11
22. (take_image satellite1 planet8 instrument2 image0)
   added: (have_image planet8 image0)
   goals met: 10 of 11
23. (turn_to satellite1 planet9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet9)
   goals met: 10 of 11
24. (take_image satellite1 planet9 instrument2 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 11 of 11
